{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_1",
            "layers": [
                {
                    "class_name": "Conv2D",
                    "config": {
                        "filters": 16,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_in",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            4,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_Conv2D1",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            50,
                            3,
                            1
                        ],
                        "dtype": "float32"
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "pool_size": [
                            2,
                            1
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            1
                        ],
                        "data_format": "channels_last",
                        "name": "max_pooling2d_MaxPooling2D1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null,
                        "name": "dropout_Dropout1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "filters": 16,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_in",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            2,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_Conv2D2",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null,
                        "name": "dropout_Dropout2",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "filters": 16,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_in",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            2,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_Conv2D3",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null,
                        "name": "dropout_Dropout3",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_Flatten1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 4,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_in",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense1",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "tfjs-layers 2.3.0",
        "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v2.3.0",
    "convertedBy": null,
    "weightsManifest": [
        {
            "paths": [
                "./gestures.tfjsmodel.weights.bin"
            ],
            "weights": [
                {
                    "name": "conv2d_Conv2D1/kernel",
                    "shape": [
                        4,
                        3,
                        1,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D1/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D2/kernel",
                    "shape": [
                        2,
                        1,
                        16,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D2/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D3/kernel",
                    "shape": [
                        2,
                        1,
                        16,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D3/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/kernel",
                    "shape": [
                        336,
                        4
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/bias",
                    "shape": [
                        4
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}