{"name":"model_editor-model","inputShape":[20,3],"inputTypes":["x","y","z"],"inputInterval":50.30000001192093,"labels":["still","tilt_left","tilt_right","shake"],"modelJSON":{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_4","layers":[{"class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[4],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D10","trainable":true,"batch_input_shape":[null,20,3],"dtype":"float32"}},{"class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D7","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout10","trainable":true}},{"class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D11","trainable":true}},{"class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D8","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout11","trainable":true}},{"class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D12","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout12","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightData":null,"weightSpecs":[{"name":"conv1d_Conv1D10/kernel","shape":[4,3,16],"dtype":"float32"},{"name":"conv1d_Conv1D10/bias","shape":[16],"dtype":"float32"},{"name":"conv1d_Conv1D11/kernel","shape":[2,16,16],"dtype":"float32"},{"name":"conv1d_Conv1D11/bias","shape":[16],"dtype":"float32"},{"name":"conv1d_Conv1D12/kernel","shape":[2,16,16],"dtype":"float32"},{"name":"conv1d_Conv1D12/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[4],"dtype":"float32"}]},"modelStats":{"total":{"name":"TOTAL","inputShape":[20,3],"outputShape":[4],"arenaBytes":1608,"codeBytes":2564,"weightBytes":5544,"unoptimizedCycles":54950,"optimizedCycles":48362},"layers":[{"name":"conv1d_Conv1D10","unoptimizedCycles":21462,"optimizedCycles":19186,"arenaBytes":1328,"inputShape":[20,3],"outputShape":[17,16],"weightBytes":448,"codeBytes":434},{"name":"max_pooling1d_MaxPooling1D7","unoptimizedCycles":4209,"optimizedCycles":3617,"arenaBytes":1600,"inputShape":[17,16],"outputShape":[8,16],"weightBytes":0,"codeBytes":72},{"name":"dropout_Dropout10","unoptimizedCycles":0,"optimizedCycles":0,"arenaBytes":0,"inputShape":[8,16],"outputShape":[8,16],"weightBytes":0,"codeBytes":0},{"name":"conv1d_Conv1D11","unoptimizedCycles":19142,"optimizedCycles":16802,"arenaBytes":960,"inputShape":[8,16],"outputShape":[7,16],"weightBytes":1088,"codeBytes":706},{"name":"max_pooling1d_MaxPooling1D8","unoptimizedCycles":1809,"optimizedCycles":1537,"arenaBytes":640,"inputShape":[7,16],"outputShape":[3,16],"weightBytes":0,"codeBytes":72},{"name":"dropout_Dropout11","unoptimizedCycles":0,"optimizedCycles":0,"arenaBytes":0,"inputShape":[3,16],"outputShape":[3,16],"weightBytes":0,"codeBytes":0},{"name":"conv1d_Conv1D12","unoptimizedCycles":6822,"optimizedCycles":5730,"arenaBytes":320,"inputShape":[3,16],"outputShape":[2,16],"weightBytes":1088,"codeBytes":666},{"name":"dropout_Dropout12","unoptimizedCycles":0,"optimizedCycles":0,"arenaBytes":0,"inputShape":[2,16],"outputShape":[2,16],"weightBytes":0,"codeBytes":0},{"name":"flatten_Flatten4","unoptimizedCycles":0,"optimizedCycles":0,"arenaBytes":0,"inputShape":[2,16],"outputShape":[32],"weightBytes":0,"codeBytes":0},{"name":"dense_Dense4","unoptimizedCycles":1506,"optimizedCycles":1490,"arenaBytes":144,"inputShape":[32],"outputShape":[4],"weightBytes":272,"codeBytes":278}]},"outputShape":4,"status":"trained","trainingAcc":0.9750000238418579,"weights":[3200482900,3180887003,3184142801,3178523697,3183061750,1049593818,1037089184,1053644868,3190045066,3183040905,3191885443,3190982125,3195420175,3196009732,3191174177,1046271135,3187119021,1040234439,1054162976,3180832582,1040167754,3177596694,3182870628,3192581570,3170909782,1031478889,1052604698,1035364517,3184292801,3197470994,1051618220,1044548027,1054178850,1024279603,1044937409,3170917915,1028143649,1043717577,3184836654,3194780023,3197286709,3180276896,3173966172,1044392231,1037865695,3184454694,3186233850,3201038971,3197169962,3190233478,3179053953,1045469021,1022969794,3164478103,1050247781,3184331235,3188028466,1032701813,1025151022,3199792895,3194035196,1035859917,1039447251,3176295490,3168665638,1028868838,1045346143,3194075627,1045441157,1041009996,3197483940,1027600719,1049439139,1050507199,1054811703,1034264169,1031375044,1034028508,3170760775,1032015988,1034871066,3191075142,3175406674,1049442005,1042217207,3198461618,3181921844,3197654018,3184495922,1035789407,1031702897,1029374292,1038759182,3186122332,1014256477,3181407393,1051170917,1048004340,1031181001,3196374758,1042710240,3179357954,1051130875,3167638913,3191152634,3186505296,1044046968,3197243194,1049422422,1040787386,1032732823,3170890321,3181071190,3171256059,1050989314,1004662818,1049244712,3179045003,1044527332,3189955390,1038034055,3168736750,1047456830,3174633647,1042138805,1031219304,3191101753,1043941681,3167841464,3182042559,1039440791,1055502440,1042739139,1048802856,3181821914,3179552469,3191560304,3190388754,3166224083,3165866303,1053042820,3187647139,1031392702,3198093085,1051563682,1043424460,1038385952,3190992278,3185602495,3181420292,1053436524,3192664079,3177853021,1035991400,3181609573,3181965362,1050206613,3190730410,3149854179,3195104746,1050638145,3184316161,1024353504,3181695522,1051209061,1023322088,3201972436,1044082068,1045235692,1042594456,1047505961,1051728847,3189563881,1039350693,1050612936,1030312950,3198377701,3205060431,1035412605,1050341477,3192966087,3192362555,1000456542,3191435088,3179240840,1041731995,1033705154,1036682627,1053264072,1051346036,1041479316,3187526907,1021785464,3176183140,1034787497,3178788545,1035242664,3177776628,1045508155,1033234423,1027860287,1021618340,1037295857,1031206197,1042749569,3162334924,1024428263,3188708840,1043154709,1054785378,1033967605,1011249244,1053741713,1034126655,3179919648,1022467894,1053274968,1051414003,3171773913,3178368551,1048472012,1050324699,1044003406,1052982355,3192778287,1038087213,1050791920,1031508460,1049773394,3201438211,3156620623,3198576799,1048597807,1054852920,1017656223,1052462224,3194525528,1026198658,3186347895,1052138508,1051160369,3189503172,1033261685,3190817115,3193830954,1044289123,1043049370,3198028994,3174223865,1040932670,3183256513,3196269045,3175256964,1035240268,3191579763,3198809800,3198990276,1027104420,1049592742,1053786233,1039577077,3202727693,3156885060,3183223023,3167124878,3185816781,1053433082,1053075177,3194910420,3185244832,1042639235,1047701655,1040567313,1018637622,3185736163,989306296,1046602442,1057161416,1036654770,3164940990,1042250252,1029598774,3188558427,3189495970,3191424882,3190337310,3154678048,1034648571,3198498697,1055877913,1050771976,984581620,3179870248,3192755731,1045933861,3171476134,1052402482,1015047633,3178267677,1032322741,3196845499,1034841036,1037463963,1026785687,1055219040,3179741197,3173334442,3173580346,1040784127,1007949906,3188121617,1043921661,3175192425,1043869689,1034729497,1028308013,1054133428,3191943903,1051718663,3197068936,3181397458,1016730481,1050719390,3171637492,1047145469,3197805870,1026129703,3166228058,1041633049,1041131306,1029243936,1051150128,3173555443,3197721134,1049255103,1038970408,3172172297,3190279693,3185796878,3191734705,3196136076,3182204868,1032666482,3187578967,3177973437,1004111402,1033328674,1040595468,1040632630,1044437066,1044885335,993218578,3172941963,3154359649,1051915933,3188229804,3190116275,1038459184,1040525350,3189390382,1038756373,3174438541,3197026408,1032182290,3193880636,3163658653,3186556223,3187437782,1029713516,3187989715,3191287175,3199627250,1011414243,1054266919,1052127409,3180175958,1029503370,3174142886,3191088720,3191206276,3194596816,3196634644,1032748429,3199645902,3198234136,1001857095,1029206207,1034928111,3185979196,3183519129,1044277372,3188036048,1034686881,1024300239,1043018713,3187683601,1049802092,1044071385,1027099925,3191238588,1040328357,1034986936,3195192797,1024813841,1041251220,1042948951,3180705031,3196650382,3180259429,1055754585,1045545115,1044275486,1045895264,1025372099,1045920237,3178903550,3188234529,1049436504,1043155499,3172055397,1038153086,3175202526,3180321539,1038232983,1046961907,1052120754,3196667653,1045417316,3175428245,1022722518,1043975886,3179229699,1038208509,1053797031,1038553766,3174183474,1052233217,1052560209,1043850581,3190265571,1046678650,1034135036,1044158357,1046819261,1048782048,3190789288,1043326382,3194704363,3197682788,3183794640,1015470892,1037891134,3156640275,3163911051,1052866517,3167570243,3185112825,3196198343,1035503693,1044156865,3195982040,1026982646,1028001123,1046680552,1032385504,1057929015,1050332455,3177720208,1049261332,3172767479,3139696392,3195413072,1057368775,1058800532,3199629349,3190764963,3197562839,1008587700,1051974425,3186133511,3180313638,1050312172,1048264751,1052770564,1042400877,3202352057,1039725749,3204233966,1037527745,3132198218,1048700660,1003484799,3195208063,1031589361,1051887102,1046980820,1017450596,3178996872,1039700824,3196700510,3194496444,1037922657,1050730932,3183768232,1049000713,1033482908,1022876165,3166347304,3201079258,1023116049,1049194366,3146684181,3198457417,3196786184,3183510307,1049889806,1041770718,3197691720,3198524463,1048549675,3197007165,3156117846,1049199764,1056585059,3180549313,1048835307,1049145105,1050933082,3172980326,3172128876,3194252208,1025823088,1044577379,1049350001,1043979389,3192633424,3187949031,1049603573,3196142947,3188432413,1022400780,1039543146,1035506998,1033415784,1051989816,1049655663,1046315482,1046474189,1057733124,3199673836,1036182206,3188188781,1043638236,1049478008,1037672028,3189228856,3184599027,1035775497,1007793873,1040082104,1054582623,3160365900,1036179918,3157340246,3188945544,1032401809,3192972683,3170347930,3159291413,1022850449,1020590080,1041330153,1048885865,1044864425,1049330126,1048413144,3191851902,1026878752,3172610069,1051238459,3164511879,3176211378,3182050218,1041949231,3159616985,1038996744,1040942021,1035753998,1042663610,1046777018,1034308810,1039033073,3192467981,3172748295,1009874512,1046613861,3162180387,1051385538,1032236930,3187971048,1042757036,3196188624,1044623718,1052548756,1023540929,3189263883,3155645604,3186649688,1044726631,3181815821,1046394230,1040720137,3172394769,1050674542,1000607197,1054986218,1041505901,3189109756,3200093684,3166486658,3197175697,3167488694,3193733718,1044089208,3192291471,1047306833,1028411381,3173442244,3181258524,1052413907,1050306685,3190385158,1049569205,1025465442,3196789183,3193534861,3196237732,3196798814,1044417704,1043628013,1042315123,1042550311,1025128813,3180541013,1028755245,1053293333,1051108535,1044476125,3197423047,3185825069,1050787357,3177754705,1040103190,3173396441,1042384080,3184661840,1038954942,1044595668,1040498013,3191586299,3197975308,3187062300,3192200633,1042033945,1045993577,1040228273,1050741842,3171731885,3181811788,3177611407,1050716631,1044190101,1036424954,3128510577,1051860487,1053293139,1043473617,3154781821,1049430062,1031344434,1049021487,1052360781,1035748991,3187767885,3176151432,3152098508,1013102145,1051309207,1036810186,1035465111,3154424894,1051711092,1041065394,1048881856,3193167399,3163198313,1039081471,1015530115,3196178339,3184599306,3192651139,1031541434,3188025801,3174233824,3178497849,3196777002,1042112484,3173376445,3174481549,1016373693,3185753470,3134852376,1041760923,3199974363,1035939780,1047410362,1032970058,3187784967,3181121996,1032866685,1020097019,3180614171,3187793813,1037866301,3185842563,1040085897,1022355315,3183650600,3186762909,3182360661,1042875760,1028297632,1045425689,3185957477,1023183984,3153449291,3175385629,3177084165,1051553011,3182806299,3159581793,3195761725,1039413660,1027566157,1042811345,3175010854,3165487275,3196823199,3187519751,1046995944,1007297164,1025964573,3186186523,3151392494,1056595380,1054404288,3199586933,3197507045,1035815605,3182599998,3176150067,1034610680,3199014421,3190919107,1025940846,1043352203,3203147382,1036841552,3186506456,1052794866,3187745571,1041928191,1034757268,3197484172,1027651079,3199752303,1049698899,1043859074,1028114821,3190778373,3199013314,3171570374,3175007118,1053161141,1052059275,3173448189,3184766471,1054965251,3090731620,3198935021,3197386301,1026942483,1032925646,3192713626,3182957087,1036294484,3175595450,3180138825,3179381297,1042739825,3187230320,3196478571,3174707877,1049165649,1012183654,1024418517,1050817840,1026173830,1044170209,1025758294,3191531742,3201011803,3202574314,1040849023,3193669826,1054462670,3178756677,1045436382,1042873825,999265824,3183209053,3184058838,1052310138,1041878351,1032216533,3180604241,3178322105,997428778,1052774519,3191695252,1049917749,3190502476,3148203816,1047710898,3188788249,3167936998,1036389472,3193021212,1050777919,1018230297,3200009006,1043394886,1049902920,3179131769,1031704279,3199076829,1041323650,3189180249,3195783233,1040862176,3188467411,1035496427,3184835906,1039662185,3183453020,3184241220,1035174858,1022212886,3194216451,3188281068,3183792370,1025511193,3190406547,1027818887,3202002246,1043606337,1038764007,1037738402,1025799180,3197943683,1048241028,3194687672,3194120388,3189515670,1050634674,3192737002,1023810788,3188262258,3171282716,1039505102,3190225508,3178320027,1057731914,1049595708,3170725824,1018808876,3176756493,3165918137,1050970348,3198202059,3169307424,3196488044,3192586530,1044064881,3205197870,1051124237,1052659649,3185758580,3174093881,3163942518,1038551263,1024630577,3195681399,1054529212,3178098778,1051764201,3150335266,1046546052,3175388837,3196729879,3195415622,1042419248,1053165737,1008887383,3196670319,1040592935,1037976242,3186043366,3197049758,1043430465,1036742486,1048271461,1052153609,1053547673,3199591403,1030446514,3168930885,1042248919,1047887892,3191029949,3194980185,3178288445,3195932313,3183389092,1048557265,1050884334,1041530244,1035489036,3130026841,1043211758,1045507510,1052450262,1036288727,3184526652,1037003549,3191768012,1049001589,1048853008,1040146883,1050442231,3176377708,3182143943,1035748257,3190185328,3181833121,1015705642,1034579875,1047089834,3178553862,3185968016,1048622306,1032347887,3171471284,1049047551,1027176504,1024614124,1052960417,1042806765,1047408885,1041835060,1044910537,3181924853,1043635616,1043281470,1027105828,1046210710,3185642052,3182688500,1049068000,1041822832,1050037271,3195270768,3194482618,1016072252,1015927622,3178016123,3189810616,1045809895,3190374234,1054362081,3182972962,1049081525,1031091930,1044201263,1038179855,3191201870,3188640089,3161324218,3183176560,3162516273,3130688354,1042043321,3198378565,3185756173,1056902068,3179396889,3195856128,3190090564,3199644658,3188063081,1046219331,1051401069,3167664904,1042040661,1046690242,3185147250,3180806939,3187512314,3200576113,3157115189,3136584965,1048642362,3202517277,1040482342,3190856109,3198052332,3157627115,1053620398,1026050105,3188521719,3191641997,3200439095,3175158428,3185574371,1034346866,1049959807,3191377319,3195073370,3191029886,1056604889,3162633938,3188911916,3189136810,3181530656,3179443652,3193655389,3198293888,3174140991,1052886394,3155442427,1052183924,1044690405,3193237963,3157599571,1045336585,1051938919,3184257085,3198403004,1042807209,1055304179,1041014763,1036064039,1050358339,3196608057,1053536319,973953959,3190360631,3195120488,3178936650,1048703212,1032081588,1041976611,3190830473,1033698810,3188783509,3190702051,3172041126,3189457786,1053158527,3196251914,3192915568,3189975980,3188580181,1027351666,1042835613,3191059170,1032529897,3198295126,3180068040,1025634190,1033514022,1045397916,1048649171,3183954659,1023119051,3169571017,3162868376,3196107126,1018256930,1012810854,1044622156,1046015608,1034049258,1047204118,3197976455,1046939322,1034197819,3190705171,3185784614,3192172244,1054847105,3134314485,1041377080,3187714522,1037638448,3192452756,1040660477,3179643186,3190235582,1044787199,3195259547,1038006076,1046280710,1036228082,3162990725,3196466645,1026560963,3194852309,3176519988,3192558898,3181355674,1032151266,3176611255,3186983867,3197499442,1005197181,3177441347,1040404632,1056935307,1052200792,3195663728,1011282885,1036574843,1050004867,3172984758,3190910646,3201504308,1019208798,1049101263,1048805897,3205265955,1041018305,1053966745,1039233716,3198711558,3181684056,3149813615,1021368027,1024455573,1041946705,1037054436,1028951818,1050264990,1046714447,3188222442,999733375,1037909807,1034744627,1032589209,3169812176,1041356539,1037251078,1047352276,1042621269,1037135124,1032160046,1051298941,1043623180,1051749034,1054633643,3193602428,1049639260,1049293133,1047159637,1051276980,1036403855,1022767520,3186135604,3159771819,3137548309,3192638411,1038218939,1034212483,1050739366,1046914884,3197546902,1029082605,3189880624,1037115935,3192677469,3195591156,3183490246,1041442500,1042873154,3176557766,3177656019,3196481343,1040730711,3177052460,1046547294,1022054049,1013241983,3170814850,1029694268,1010802327,1049175739,3157713210,1044579168,3173464744,3156502832,3172245666,3164304869,3167692801,3162791254,1034035198,1040839251,1005395506,1049437846,1048010065,1040767143,3179362535,3137396053,3181199133,3194980506,3180637084,3188140395,3194473778,3199485780,3158953376,1041316589,1052683994,1045360326,1047882640,1048820692,1035013141,1035150978,3164500206,1053267578,1047418726,1016343781,995612197,3188620541,1039639133,3174284164,1028095418,1050189568,3173135188,1044240316,1046116262,1032666374,1045441790,3174155715,1040339996,3190180966,1057184023,1022209531,3188090160,3196987434,3197187449,1044084847,3154786531,3206131251,3188344880,3196805271,1044461317,1017956496,1043604124,3196079476,1051036282,1049378971,1042881893,1046312833,1033497155,3202449981,1023469549,1049077334,3195140681,1034028486,3207911814,1047491336,1043127907,3180793907,1047108802,1040938881,3201440413,3205679004,1040867664,1034959183,3204512082,1050628300,1015970355,1017986464,3200451483,3196081446,1050680141,3168804908,3177670429,1020185304,3162809371,3204510024,1044756166,3183174630,3197358348,1043755094,1049636157,3206728974,3173245429,1035540135,3208031998,1046377931,3191208747,1032454883,3197904002,3184011989,3196054400,3195090328,3190564645,1048401922,1059931611,1049930887,3146004806,3200084718,1028545158,3145750933,1049416573,1052181702,3205094757,1024952783,1050454596,1017198497,3201610381,3205735159,3189964550,1056698247,1046141484,3173302630,3196487833,1052266938,3190889795,1049227070,3196374431,3165668322,3206749921,1052650090,1047711771,1039344206,1052098250,1048145287,3195383677,3206736731,1040559550,3190633327,1035647975,3179693789,1046299431,1040633251,3189025337,3150737990,1051692198,1049739255,3205007618,3189779944,1052054163,3204417491,3200387258,3201151296,3197699360,3188232446,1041124479,3205544199,3189253159,1051904842,3200051997,1029369788,3191840185,1061806965,3201717744,3187404080,1038491103,3203275956,3197931026,1040634540,1038155174,1029996100,1015492415,3190770132]}